#**Trabalhando com Planilhas do Excel**

In [3]:
#Importando a biblioteca
import pandas as pd

In [7]:
!git clone https://github.com/Haiga/learning-python-and-pandas
!unzip learning-python-and-pandas/datasets.zip

Cloning into 'learning-python-and-pandas'...
remote: Enumerating objects: 10, done.
remote: Counting objects: 100% (10/10), done.
remote: Compressing objects: 100% (8/8), done.
remote: Total 10 (delta 2), reused 6 (delta 1), pack-reused 0
Unpacking objects: 100% (10/10), done.
Archive:  learning-python-and-pandas/datasets.zip
replace Fortaleza.xlsx? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: Fortaleza.xlsx
replace Gapminder.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: Gapminder.csv
replace Natal.xlsx? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: Natal.xlsx
replace Recife.xlsx? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: Recife.xlsx
replace Salvador.xlsx? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: Salvador.xlsx
replace AdventureWorks.xlsx? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: AdventureWorks.xlsx
replace Aracaju.xlsx? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: Aracaju.xlsx

In [8]:
#Leitura dos arquivos
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [9]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [10]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [11]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [12]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [13]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
110   Salvador 2019-03-02  185.93    1036     3
38   Fortaleza 2019-01-01   35.09    1004     4
36     Aracaju 2018-01-01   37.99    1523     8
100  Fortaleza 2019-01-01   18.58    1003     1
63      Recife 2019-01-01   37.95     980     2

In [14]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [15]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [16]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [17]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [18]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [19]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [20]:
df["Vendas"].mean()

122.61180089485438

In [21]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [22]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
92    Salvador 2019-01-01    4.57   1035     1
124  Fortaleza 2019-03-02   47.98    983     7
239      Natal 2019-01-03  161.41   1037     3
108     Recife 2019-03-02  152.89    981     4
78       Natal 2019-02-07  310.00    853     4
27       Natal 2018-07-16  390.00    853     3
235      Natal 2019-01-03   41.84   1034     1
71      Recife 2019-01-01  138.69    983     3
101     Recife 2019-01-01  172.55    983     7
86     Aracaju 2018-01-01  154.92   1521     5
164   Salvador 2019-01-02    6.59   1035     1
37   Fortaleza 2019-01-01   35.86   1002     6
86      Recife 2019-01-01   17.83    982     8
83   Fortaleza 2019-01-01    3.88   1002     6
15       Natal 2018-02-01  432.00    854     3

In [23]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [24]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [25]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [26]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [27]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [28]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [29]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [30]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [31]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [32]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [33]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [34]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [35]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [36]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

#**Trabalhando com datas**

In [37]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [38]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [39]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [40]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [41]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [42]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [43]:
df.sample(5)

       Cidade       Data  Vendas  ...  Receita  Receita/Vendas  Ano_Venda
51     Recife 2019-01-01  146.95  ...   293.90             2.0       2019
91    Aracaju 2018-01-01  200.85  ...  1205.10             6.0       2018
83   Salvador 2019-01-01   63.66  ...   127.32             2.0       2019
128   Aracaju 2018-01-01   37.49  ...    74.98             2.0       2018
94    Aracaju 2018-01-01  198.24  ...  1784.16             9.0       2018

[5 rows x 8 columns]

In [44]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [45]:
df.sample(5)

        Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
114      Natal 2019-01-02   25.52  ...      2019          1          2
202      Natal 2019-01-02   22.45  ...      2019          1          2
236   Salvador 2019-01-03  126.29  ...      2019          1          3
21      Recife 2019-01-01  164.74  ...      2019          1          1
27   Fortaleza 2019-01-01  212.37  ...      2019          1          1

[5 rows x 10 columns]

In [46]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [47]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [48]:
df.sample(5)

       Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
119    Recife 2019-03-02  152.30  ...         3          2        425 days
59      Natal 2018-01-15  369.00  ...         1         15         14 days
186  Salvador 2019-01-02  169.09  ...         1          2        366 days
20    Aracaju 2018-01-01   39.86  ...         1          1          0 days
104  Salvador 2019-01-01  188.79  ...         1          1        365 days

[5 rows x 11 columns]

In [49]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [50]:
df.sample(5)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
211   Salvador 2019-01-02  141.05  ...         2        366 days                1
64   Fortaleza 2019-01-01  110.31  ...         1        365 days                1
60      Recife 2019-01-01   37.97  ...         1        365 days                1
199      Natal 2019-01-02  153.87  ...         2        366 days                1
133     Recife 2019-03-02   14.67  ...         2        425 days                1

[5 rows x 12 columns]

In [51]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [52]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
71       Natal 2019-03-20  840.00  ...        20        443 days                1
121  Fortaleza 2019-03-02   41.55  ...         2        425 days                1
109  Fortaleza 2019-03-02   18.90  ...         2        425 days                1
126     Recife 2019-03-02   41.87  ...         2        425 days                1
110     Recife 2019-03-02   51.98  ...         2        425 days                1
134  Fortaleza 2019-03-02  195.18  ...         2        425 days                1
123     Recife 2019-03-02   20.22  ...         2        425 days                1
69       Natal 2019-03-24  817.00  ...        24        447 days                1
108  Fortaleza 2019-03-02  152.89  ...         2        425 days                1
129  Fortaleza 2019-03-02   35.34  ...         2        425 days                1
122  Fortaleza 2019-03-02  235.06  ...         2        425 days                1
139     Recife 2019-03-02  141.16  ...         2        425 days                1
128   Salvador 2019-03-02   36.84  ...         2        425 days                1
130  Fortaleza 2019-03-02   12.36  ...         2        425 days                1
117     Recife 2019-03-02   15.42  ...         2        425 days                1
7        Natal 2019-03-18  886.00  ...        18        441 days                1
140   Salvador 2019-03-02   20.79  ...         2        425 days                1
130     Recife 2019-03-02   12.36  ...         2        425 days                1
124  Fortaleza 2019-03-02   47.98  ...         2        425 days                1
141     Recife 2019-03-02  182.75  ...         2        425 days                1

[20 rows x 12 columns]